//  Min

//  1. Напиши всі можливі варіанти створення функцій.
//  - Оголошення Функції
//  - Функціональний Вираз
//  - Стрілкова функція

//  2. Створи функцію, яка буде виводити кількість переданих їй аргументів.
function countArgs(...args) {
    return args.length;
}

console.log(`Аргументи 1, 2, 3. Їх кількість: ${countArgs(1, 2, 3)}`);

// 3. Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге; 
// 1 - якщо перше число більше, ніж друге; 
// 0 - якщо числа рівні.
function compareNumbers(a, b) {
    if (a > b) {
        return 1;
    }
    else if (a < b) {
        return -1;
    }
    else return 0;
}

console.log(`Порівнюємо числа 23 і 12. Функція повертає: ${compareNumbers(23, 12)}`);

//  4. Напиши функцію, яка обчислює факторіал переданого їй числа.
function factorial(a) {
    if ((a === 0) || (a === 1)) {
        return 1;
    }
    else return a * factorial(a - 1);
}

console.log(`Факторіал від 5: ${factorial(5)}`);

//  5. Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.
function digitsToNumber(a, b, c) {
    return parseInt('' + a + b + c);
}

console.log(`1 + 2 + 3 буде '${digitsToNumber(1, 2, 3)}`);

//  6. Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.
function square(a, b = a) {
    return a * b;
}

console.log(`Площа: ${square(2, 3)}`);



//  Norm

//  1. Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.
function isPerfect(a) {
    let sum = 0;
    for (let i = 1; i <= Math.floor(a / 2); i++) {
        if (a % i === 0) {
            sum += i;
        }
    }
    return sum === a;
}

console.log(`Число 6 досконале? - ${isPerfect(6)}`);
console.log(`Число 3 досконале? - ${isPerfect(3)}`);

//  2. Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. 
//      Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.

function findPerfect(a, b) {
    let min = Math.min(a, b);
    let max = Math.max(a, b);
    let perfNums = '';
    for (let i = min; i <= max; i++) {
        if (isPerfect(i)) {
            perfNums += i + ' ';
        }
    }
    return perfNums;
}

console.log(`Які досконалі числа є у діапазоні 1-1000? - ${findPerfect(1, 1000)}`);